{
  "work": [
    {
      "start": "Jan 2017",
      "end": "Present",
      "role": "Team Lead",
      "company": "ABC",
      "summary":
        "I lead frontend teams supporting the day-to-day development of abc.net.au, one of Australia’s largest and best regarded news sites, and the development of a modern Node and React stack.",
      "points": [
        "Tech lead and architect for a greenfield React and Node frontend framework.",
        "Developed and shipped AMP site using React framework.",
        "Mentoring, recruiting, and management for a team of frontend developers."
      ]
    },
    {
      "start": "Aug 2013",
      "end": "Dec 2016",
      "role": "Engineering Manager",
      "company": "Facebook",
      "summary":
        "I managed the team that built and open sourced Relay, a JavaScript data framework for web and native apps. I also founded a team to improve JavaScript startup performance on Facebook’s desktop website.",
      "points": [
        "Recruited, mentored and conducted performance assessments for reports.",
        "Developed infrastructure road maps in collaboration with product teams across the company.",
        "Organized monthly internal tech talks attended by the company’s frontend engineers.",
        "Represented Facebook at local meetups, Web Directions Code and Yow! conferences.",
        "Conducted 200+ technical interviews and helped manage the frontend interview processes."
      ]
    },
    {
      "start": "May 2011",
      "end": "Aug 2013",
      "role": "UI Engineer",
      "summary":
        "I helped develop Timeline in 2011 and Graph Search in 2013. I also worked with Facebook’s product infrastructure team where I contributed to Facebook’s core frontend libraries.",
      "points": [
        "Contributed to open source and internal infrastructure including React, Relay, and Draft.js.",
        "Frontend tech lead for the development and launch of Graph Search.",
        "Taught front end training sessions and mentored new team members."
      ]
    },
    {
      "start": "Jul 2010",
      "end": "Apr 2011",
      "role": "Senior Programmer",
      "company": "Brightlabs",
      "summary": "I built internal and client websites.",
      "points": [
        "Developed an in-house billing system with Jira, Plesk and Zendesk integration.",
        "Built a user-facing frontend, billing systems, and administration backend for mobile virtual network."
      ]
    },
    {
      "start": "Jan 2010",
      "end": "Apr 2011",
      "role": "Senior Programmer",
      "company": "Various",
      "summary":
        "I undertook a number of short contract roles while living in London.",
      "points": [
        "Sole developer for redevelopment of The Beatles’ official website and CMS (Sapient Nitro).",
        "Maintained Symfony powered sites for Marie Claire, InStyle, Wedding and Look (IPC Media).",
        "Built a PHP-powered interactive game promoting Warner Bros. film Sherlock Holmes (AKQA).",
        "Maintained and extended the Symbian Developer site (Symbian Foundation)."
      ]
    },
    {
      "start": "Nov 2006",
      "end": "Dec 2008",
      "role": "Senior Programmer",
      "company": "DoubleClick Industries",
      "summary":
        "I was the frontend developer for FileFactory, a popular file sharing network.",
      "points": [
        "Maintained and relaunched site frontend using a new PHP stack.",
        "Developed Facebook application for photo, audio, and file sharing.",
        "Created .NET application which which was the source of 50% of uploads."
      ]
    },
    {
      "start": "Jun 2004",
      "end": "Oct 2006",
      "role": "Lead Web Developer",
      "company": "Bugal",
      "summary":
        "I was responsible to maintaining multiple websites for mobile content brands, and led a team of developers building a new social networking site.",
      "points": [
        "Recruited and led local and remote development teams.",
        "Designed custom MVC framework using PHP, MySQL and Memcached.",
        "Integrated third-party avatar chat room, webmail and an IM client.",
        "Launched features including profiles, photo albums, blogging, friend feed, forums, post via SMS, micropayments, ads delivery, Flash games arcade."
      ]
    }
  ],
  "education": [
    {
      "company": "Griffith University",
      "role": "Bachelor of Multimedia",
      "start": "2001",
      "end": "2003",
      "summary":
        "Bachelor of Multimedia, majoring in Interactive Entertainment and Games Programming.",
      "points": [
        "Awarded Multimedia Studies Medal for the highest GPA amongst graduating class.",
        "Recipient of School of Computing and Information Technology Multimedia Award."
      ]
    }
  ]
}
