{
  "work": [
    {
      "start": "Jan 2017",
      "end": "Present",
      "role": "Manager, Web Platform",
      "company": "ABC",
      "summary": "I manage frontend teams supporting abc.net.au, and oversaw the to effort to modernise the ABC's frontend stack.",
      "points": [
        "Designed and led implementation of a React framework and continous delivery pipeline for ABC's suite of web products.",
        "Delivered the implementation of ABC's design language in React.",
        "Delivered AMP functionality that led to a massive boost to reach, greatly exceeding ABC News' yearly traffic goals.",
        "Hiring, mentoring, and management for Brisbane development teams."
      ]
    },
    {
      "start": "Aug 2013",
      "end": "Dec 2016",
      "role": "Engineering Manager",
      "company": "Facebook",
      "summary": "I managed and led the GraphQL web client team in developing and open sourcing Relay. The framework now powers Facebook’s websites, Mobile Ads Manager, Groups native app, and Marketplace products. I also founded a team to improve JavaScript startup performance on Facebook’s desktop website.",
      "points": [
        "Recruited, mentored and conducted performance assessments.",
        "Collaborated with product teams to gather requirements and develop infrastructure road maps.",
        "Conducted over 200 technical interviews and helped refine the frontend interviewing processes.",
        "Ran regular internal tech talks for frontend engineers.",
        "Represented Facebook through presentations at meetups, Web Directions Code and Yow! conferences."
      ]
    },
    {
      "start": "May 2011",
      "end": "Aug 2013",
      "role": "UI Engineer",
      "summary": "As a front engineer I helped build many core elements of Facebook including the primary site navigation, UI for search, user profile navigation, and the rich text input used sitewide for posting and commenting.",
      "points": [
        "Contributed to open source and internal infrastructure including React, Relay, and Draft.js.",
        "Frontend tech lead for the development and launch of Graph Search.",
        "Taught front end training sessions and mentored new team members."
      ]
    },
    {
      "start": "Jul 2010",
      "end": "Apr 2011",
      "role": "Senior Programmer",
      "company": "Brightlabs",
      "summary": "As a web developer I delivered greenfield internal and client websites.",
      "points": [
        "Developed an in-house billing system with Jira, Plesk and Zendesk integration.",
        "Built a user-facing frontend, billing systems, and administration backend for mobile virtual network."
      ]
    },
    {
      "start": "Jan 2010",
      "end": "Apr 2011",
      "role": "Web Developer",
      "company": "Various",
      "summary": "I undertook a number of contract roles across London.",
      "points": [
        "Lead developer for The Beatles’ official website and CMS (Sapient Nitro).",
        "Maintained Symfony-powered sites for Marie Claire, InStyle, Wedding and Look (IPC Media).",
        "Built a PHP-powered interactive game promoting the film Sherlock Holmes (AKQA).",
        "Development of the Symbian Developer site (Symbian Foundation)."
      ]
    },
    {
      "start": "Nov 2006",
      "end": "Dec 2008",
      "role": "Web Developer",
      "company": "DoubleClick Industries",
      "summary": "I was the frontend developer for FileFactory, a popular file sharing network.",
      "points": [
        "Maintained and relaunched site frontend usign PHP.",
        "Developed Facebook application for photo, audio, and file sharing.",
        "Created .NET upload and download manager which handled 50% of site traffic."
      ]
    },
    {
      "start": "Jun 2004",
      "end": "Oct 2006",
      "role": "Lead Web Developer",
      "company": "Bugal",
      "summary": "I was responsible to maintaining multiple websites for mobile content brands, and led a team of developers building a new social networking site.",
      "points": [
        "Recruited and led teams locally and in the Philippines.",
        "Designed custom MVC framework using PHP, MySQL and Memcached.",
        "Integrated third-party avatar chat room, webmail and an IM client.",
        "Launched features including profiles, photo albums, blogging, friend feed, forums, post via SMS, micropayments, ads delivery, Flash games arcade."
      ]
    }
  ],
  "education": [
    {
      "company": "Griffith University",
      "role": "Bachelor of Multimedia",
      "start": "2001",
      "end": "2003",
      "summary": "Bachelor of Multimedia, majoring in Interactive Entertainment and Games Programming.",
      "points": [
        "Awarded Multimedia Studies Medal for the highest GPA amongst graduating class.",
        "Recipient of School of Computing and Information Technology Multimedia Award."
      ]
    }
  ]
}