[
  {
    "name":
      "Exploring Static Types: Writing Typesafe Code that Feels Like Real JavaScript",
    "venue": "Web Directions Summit, 2017",
    "description":
      "​For twenty years JavaScript's dynamic typing has given us an easy-to-use scripting language. But now Flow and TypeScript are changing the foundations of the language. Far from turning our code into an object oriented mess, static typing gives us JavaScript code that's cleaner, simpler and more predictable. And by embracing the nature of typechecking, we end up with interfaces that are easier for humans to understand too.",
    "urls": {
      "http://www.webdirections.org/wds/speakers/josh-duck.html": "Schedule",
      "https://github.com/joshduck/exploring-static-types": "Slides and Notes"
    }
  },
  {
    "name": "Designing a Culture that Fosters Growth",
    "venue": "Web Directions Leaders, 2017",
    "description":
      "​Many companies say they want the best developers. But they don’t back that up with their actions. Facebook has invested heavily in designing a culture that grows developers over many years.\n\nIn this presentation I share lessons learned working for Facebook, a companay that has held a high bar for quality while growing its engineering head count at an almost unimaginable rate over the last decade.",
    "urls": { "https://www.webdirections.org/leaders/#speakers": "Schedule" }
  },
  {
    "name": "Frontend At Scale: Designing Infra For Big Teams",
    "venue": "Yow! 2016",
    "description":
      "​Developing high quality web applications means understanding browser quirks, web performance, testing strategies, and API design. Getting all of this right is difficult in an organization where hundreds of engineers are collaborating on the same codebase,\n\nThis talk looks at how Facebook tackles this problem with stable infrastructure for data fetching, code delivery, performance profiling, and testing.",
    "urls": {
      "http://www.webdirections.org/wds/speakers/josh-duck.html": "Schedule",
      "https://www.youtube.com/watch?v=LrfSSAET6iY": "YouTube"
    }
  },
  {
    "name": "Rediscovering the Server",
    "venue": "Web Directions Code, 2016",
    "description":
      "React makes it easy to build beautiful and responsive JavaScript applications, but moving rendering from server to client reveals new and unique performance challenges. Preloading data, minimizing round trips, and reducing JS overhead are just some of the problems JavaScript developers face.\n\nFacebook is combining the strengths of server and client execution with abstractions like GraphQL and Relay, and we see how we can apply the same design principles to other performance problems.",
    "urls": {
      "http://webdirections.org/code16/speakers/josh-duck.html": "Schedule",
      "https://www.youtube.com/watch?v=b875VAC6r-w": "YouTube"
    }
  },
  {
    "name": "GraphQL + Relay",
    "venue": "BrisJS",
    "description":
      "A primer on GraphQL, a query language for APIs, and Relay, a framework for defining GraphQL queries and managing data on the client.",
    "urls": {
      "https://www.youtube.com/watch?v=HcnHuy3G1xY": "YouTube",
      "https://github.com/joshduck/example-relay-app": "Code Samples"
    }
  }
]
